Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/compiled/ted2020v1/en-ne.tmx
Source language: en
Languages: ne

source: The UN Framework Convention on Climate Change says that if these so-called intended commitments are kept, we'd be closer to containing global warming by two degrees Celsius.
ne: संयुक्त रासंको वातावरण परिवर्तनसम्बन्धी धारणापत्रमा माथिको प्रतिबद्धतालाई मध्यनजर गर्दै भूमण्डलीय तपक्रमसँग नजिकिने छौ दुई डिग्री से. ले भए पनि

source: By the way, I've requested the TED organizers here to turn up the heat in here by two degrees, so if some of you are feeling warmer than usual, you know who to blame.
ne: कुराको प्रसङ्गमा, भनौं कि TED आयोजकहरूसँग मैले यहाँ २ डिग्री तापक्रम बढी गर्न अनुरोध गरेको छु त्यसैले तपाईहरूले सधैँ भन्दा न्यानो महसूस गर्नुभएको छ भने थाहै छ कसलाई दोष लाउने|

source: It's crucial that all of us keep our commitments.
ne: हामी सबै निर्णायक बचनप्रति प्रतिबद्ध छौं

source: As far as Bhutan is concerned, we will keep our promise to remain carbon neutral.
ne: भूटानको हकमा भन्ने हो भने हामी कार्वन सन्तुलन गराउने कुरामा प्रतिबद्ध छौं

source: Here are some of the ways we are doing it.
ne: यसमा हाम्रा केही कार्ययोजना यस्ता छन्

source: We are providing free electricity to our rural farmers.
ne: गाउँका किशानलाई निःशुल्क बिजुली उपलब्ध गराउँने छौं

source: The idea is that, with free electricity, they will no longer have to use firewood to cook their food.
ne: यसले उनीहरूलाई सँधै दाउराको उपयोग गर्नुपर्दैन खाना बनाउने काममा

source: We are investing in sustainable transport and subsidizing the purchase of electric vehicles.
ne: हामी दीगो यातायातमा लगानी गर्नेछौं विदयुतीय वाहन खरीदमा विशेष छूटको व्यवस्था

source: Similarly, we are subsidizing the cost of LED lights, and our entire government is trying to go paperless.
ne: यसैगरि LED बत्तीको मूल्यमा पनि छूट अनि सरकारको सम्पूर्ण काम कागतरहित पार्ने कोशिस

source: We are cleaning up our entire country through Clean Bhutan, a national program, and we are planting trees throughout our country through Green Bhutan, another national program.
ne: 'सफा भूटान'को राष्ट्रिय नाराले सम्पूर्ण देशलाई नै सफा राख्छौं देशभर वृक्षरोपण गर्ने अभियान हरित भूटानतिर अर्को राष्ट्रिय अभियान

source: But it is our protected areas that are at the core of our carbon neutral strategy.
ne: यी हाम्रा सुरक्षित क्षेत्रहरू त कार्वन ऋणात्मक रणनीतिको मुटु हो

source: Our protected areas are our carbon sink.
ne: हाम्रो संरक्षित क्षेत्र त कार्वन हटाउने क्षेत्र हो

source: They are our lungs.
ne: ती त हाम्रा फोक्सा हुन्

source: Today, more than half our country is protected, as national parks, nature reserves and wildlife sanctuaries.
ne: अहिले हाम्रो देशको आधाभन्दा बढी भाग संरक्षित छ राष्ट्रिय उद्यान, प्रकृति संरक्षण एवं वन्यजन्तु आरक्षण क्षेत्र

source: But the beauty is that we've connected them all with one another through a network of biological corridors.
ne: सौन्दर्य कहाँ छ भने हामीले ती सबैलाई एक आपसमा जोडेका छौं एउटै जैविक गोरेटोको संजालमा

source: Now, what this means is that our animals are free to roam throughout our country.
ne: त्यो भनेको के हो भने हाम्रा सबै जनावरहरू आफूखुशी एक ठाउँबाट अर्को ठाउँ जानसक्छन्

source: Take this tiger, for example.
ne: उदाहरणको रूपमा यो बाघ

source: It was spotted at 250 meters above sea level in the hot, subtropical jungles.
ne: २५० मी. को उचाइमा तातो उष्णप्रदेशमा देखिएको थियो

source: Two years later, that same tiger was spotted near 4,000 meters in our cold alpine mountains.
ne: दुइ वर्ष पछि त्यही नै बाघ ४००० मी उचाइमा देखापर्यो हाम्रो चीसो उच्च पर्वतीय क्षेत्रमा

source: Isn't that awesome?
ne: गजब छैन त?

source: (Applause) We must keep it that way.
ne: (हर्षध्वनि) हामीले यसरी संरक्षण गर्नैपर्छ

source: We must keep our parks awesome.
ne: हामीले हाम्रा उद्यानलाई गजबको बनाउनै पर्छ

source: So every year, we set aside resources to prevent poaching, hunting, mining and pollution in our parks, and resources to help communities who live in those parks manage their forests, adapt to climate change, and lead better lives while continuing to live in harmony with Mother Nature.
ne: हरेक वर्ष हामी अवैध शिकार रोक्ने साधनको जगेर्ना गर्छौं उत्खनन एवं उद्यानमा प्रदूषण अनि संरक्षण क्षेत्रमा बस्नेलाई साधन सहयोग उनीहरूको जङ्गलको व्यवस्थापन वातावरणको परिवर्तन सहन प्रकृति मातासँग सामञ्जस्य गरेर अझ सुन्दर जीवन जिउन

source: But that is expensive.
ne: तर यो एकदमै खर्चिलो छ

source: Over the next few years, our small economy won't have the resources to cover all the costs that are required to protect our environment.
ne: आगामी केही वर्षभित्र हाम्रो सानो अर्थव्यवस्थाले सबै स्रोतहरूको वातावरण संरक्षणको अावश्यक सबै खर्च धान्न सक्दैन

source: In fact, when we run the numbers, it looks like it'll take us at least 15 years before we can fully finance all our conservation efforts.
ne: वास्तवमा यी सबै क्रम चलाउँदै जाँदा हामीलाई कम से कम १५ वर्ष लाग्छ जस्तो छ संरक्षणको हाम्रा सबै प्रयत्नहरूमा पूर्ण लगानी गर्न

source: But neither Bhutan, nor the world can afford to spend 15 years going backwards.
ne: तर न त भूटान नै न त सारा विश्व नै १५ वर्ष पछाडि समय विताउन सक्छन्

source: This is why His Majesty the King started Bhutan For Life.
ne: त्यसै कारणले हाम्रा महाराज सरकारबाट ‘जीवनको लागि भूटान’ सुरुवात भयो

source: Bhutan For Life gives us the time we need.
ne: 'जीवनको लागि भूटान’ ले हामीलाई चाहिएको समय दिन्छ

source: It gives us breathing room.
ne: सास फेर्ने ठाउँ दिन्छ

source: It is essentially a funding mechanism to look after our parks, to protect our parks, until our government can take over on our own fully.
ne: यो अनिवार्य रूपको कोषको व्यवस्था हो उद्यानहरूको हेरचाह गर्न उद्यानहरूको संरक्षण गर्न सरकार पूर्णतया व्यवस्थापन गर्न सक्ने नहुञ्जेल

source: The idea is to raise a transition fund from individual donors, corporations and institutions, but the deal is closed only after predetermined conditions are met and all funds committed.
ne: सङ्क्रमणकालको कोष व्यवस्था गर्ने विचार व्यक्तिगत, संघ–संस्थाहरू, दातृनिकाय पूर्वनिर्धारित शर्त पूरा गरेपछि मात्रै संझौता गरिने सबै रकम प्रतिबद्ध

source: So multiparty, single closing: an idea we borrowed from Wall Street.
ne: धेरैको सहयोगमा एकल समापन - ‘वाल स्ट्रिट’सँग विचारको सापटी लिएको

source: This means that individual donors can commit without having to worry that they'll be left supporting an underfunded plan.
ne: यसको अर्थ यो हो कि व्यक्तिगत दाताहरूले पनि पछि के होला भन्ने चिन्ता नलिइकन सहयोगको वचन दिन सक्छन्

source: It's something like a Kickstarter project, only with a 15-year time horizon and millions of tons of carbon dioxide at stake.
ne: एक प्रकारले ‘किकस्टार प्रोजेक्ट’ जस्तै १५ वर्षको समयघेरामा लाखौं टन कार्वन डायअक्साइडको खतरा

source: Once the deal is closed, we use the transition fund to protect our parks, giving our government time to increase our own funding gradually until the end of the 15-year period.
ne: एक पटक कुरो टुङ्गिएपछि त्यो कोष हाम्रा उद्यान संरक्षणमा सदुपयोग गर्नेछौं सरकारलाई आफ्नो कोषको वृद्धि गर्न क्रमशः समय हुनेछ १५ वर्षको अन्त्य सम्ममा

source: After that, our government guarantees full funding forever.
ne: त्यसपछि भने हाम्रो सरकारले कोषको पूर्णतया जिम्मा लिनेछ

source: We are almost there.
ne: हामी करिब त्यहाँ पुग्छौं

source: We expect to close later this year.
ne: यसवर्ष पछि यसलाई बन्द गर्ने आशामा छौं

source: Naturally, I'm pretty excited.
ne: स्वभावैले म एकदमै उत्साही छु

source: (Applause) The World Wildlife Fund is our principle partner in this journey, and I want to give them a big shoutout for the excellent work they are doing in Bhutan and across the world.
ne: (करतलध्वनि) यस यात्रामा ‘विश्व वन्यजन्तु कोष’ हाम्रो प्रमुख साझेदार रहेको छ म उनीहरूको ठूलो प्रशंसा गर्न चाहन्छु भूटानमा अत्यन्त उपयोगी काम गरिरहेका छन् र विश्वभर नै

source: (Applause) Whew, it is getting warm in here.
ne: (तालिसँगै हर्षध्वनि) उफ् ! साहै्र गर्मी पो भयो कि क्या !

source: I thank you for listening to our story, a story of how we are keeping our promise to remain carbon neutral, a story of how we are keeping our country pristine, for ourselves, our children, for your children and for the world.
ne: कहानी सुनिदिनुभएकोमा यहाँहरू सबैमा आभार ! कार्वन न्यून गर्नमा हामीले आफ्नो वचन कसरि पालन गरिरहेका छौं हामीले हाम्रो देशलाई कसरि मौलिक रूपमा नै राखिरहेका छौं भन्ने वर्णन हाम्रा लागि, हाम्रा सन्ततिका लागि यहाँका सन्ततिका लागि अनि पूरै विश्वका लागि

source: But we are not here to tell stories, are we?
ne: तर हामी कथा सुन्न भेला भएका होइनौ, हौ र ?

source: We are here to dream together.
ne: हामी यहाँ सँगसँगै सपना देख्न आएका हौं

source: So in closing, I'd like to share one more dream that I have.
ne: अन्तमा, म एउटा अर्को सपना साट्न चाहन्छु

source: What if we could mobilize our leadership and our resources, our influence and our passion, to replicate the Bhutan For Life idea to other countries so that they too can conserve their protected areas for all time.
ne: हामीले आफ्नो नेतृत्व र हाम्रो स्रोतसाधन हाम्रो प्रभाव अनि उत्कट अभिलाषा ‘जीवनको लागि भूटान’ नारा अन्य देशमा पनि लागू गर्न पाए कस्तो होला ? ता कि उनीहरू पनि आफ्नो संरक्षित क्षेत्रको सदैव संरक्षण गरुन्

source: After all, there are many other countries who face the same issues that we face.
ne: आखिर हाम्रोजस्तो समस्या भोगेका अरू देशहरू पनि प्रशस्त छन्

source: They too have natural resources that can help win the world's fight for sustainability, only they may not have the ability to invest in them now.
ne: उनीहरूसँग पनि प्राकृतिक सम्पदा प्रशस्त छ विश्वमा स्थिरता कायम गर्ने लडाइमा सहायक हुन सक्छ उनीहरूमा अहिल्यै लगानी गर्ने त्यो क्षमता नहुन पनि सक्छ

source: So what if we set up Earth For Life, a global fund, to kickstart the Bhutan For Life throughout the world?
ne: यदि हामीले ‘जीवनको लागि विश्व’ रचना गर्ने हो भने ‘विश्व वित्तकोष’ ‘किकस्टार्ट’ जीवनको लागि ‘भूटान’ बाट ‘विश्वतिर’

source: I invite you to help me, to carry this dream beyond our borders to all those who care about our planet's future.
ne: म सहयोगको लागि आमन्त्रण गर्दछु अाउनुहोस् यो सपनालाई सीमापारसम्म लैजाऔं यो ग्रहको भविष्यमाथि चिन्ता गर्नेहरूसम्म

source: After all, we're here to dream together, to work together, to fight climate change together, to protect our planet together.
ne: आखिर हामी यहाँ साझा सपना देख्दै छौं सहकार्य गर्दैछौ वातावरण परिवर्तनको लडाइमा, सँगसँगै हाम्रो ग्रहको सुरक्षामा

source: Because the reality is we are in it together.
ne: वास्तविकता के हो भने हामी यस भूमिमा सँगसँगै नै छौं

source: Some of us might dress differently, but we are in it together.
ne: कसै कसैले लुगा फरक फरक लगायौं होला तर हामी सँगसँगै नै छौं

source: Thank you very much, and kadrin chhe la. Thank you.
ne: सबैमा मुरी मुरी धन्यवाद ताशि दे ला ! धन्यवाद

source: (Applause) Thank you, thank you, thank you.
ne: (तालिसँगै हर्षध्वनि) धन्यवाद, धन्यवाद, धन्यवाद

source: Periods.
ne: महिनावारी

source: Blood.
ne: रगतका टाटा

source: Menstruation.
ne: मासिकश्राव

source: Gross.
ne: बढाइचढाइ

source: Secret.
ne: गोप्य

source: Hidden.
ne: गोपनीय

source: Why?
ne: आखिर के कारण ?

source: A natural biological process that every girl and woman goes through every month for about half of her life.
ne: एउटा प्राकृतिक जैविक प्रक्रिया जसलाई हरेक युवती अथवा महिलाले हरेक महीना यसै गरेर आफ्नो आधाजस्तो उमेर पार गर्नुपर्छ,

source: A phenomenon that is so significant that the survival and propagation of our species depends on it.
ne: एउटा सार्थक अनि शाश्वत प्रक्रिया जसमा हामी र हाम्रा प्रजातिको

source: Yet we consider it a taboo.
ne: अस्तित्व निर्भर गर्दछ । तैपनि यसलाई लाजको रुपमा हेरिन्छ

source: We feel awkward and shameful talking about it.
ne: यस विषयमा कुरा गर्न अप्ठ्यारो र सरम महशूस हुन्छ

source: When I got my first periods, I was told to keep it a secret from others -- even from my father and brother.
ne: म पहिलोपटक रजस्वला हुँदा , यो कुरालाइ गोप्य राख्न लगाइयो, आफ्नै बुबा र दाजुभाइबाट समेत

source: Later when this chapter appeared in our textbooks, our biology teacher skipped the subject.
ne: पछि स्कूलमा यो विषय आउँदा जीवविज्ञानको शिक्षकले यो पाठ नै पढाउनुभएन|

source: (Laughter) You know what I learned from it?
ne: (लामो हाँसो ) तपाईलाइ थाहा छ, यी घटनाबाट मैलेके सिकें?

source: I learned that it is really shameful to talk about it.
ne: मैले सिकें - महिनावारीको बारेमा कुरा गर्नु लाजलाग्दो बिषय हो ।

source: I learned to be ashamed of my body.
ne: मैले आफ्नै शरीरसँग सरम मान्न सिकें ।

source: I learned to stay unaware of periods in order to stay decent.
ne: महिनावारीसँग अन्जान रहन सिकें, ताकि म सभ्य मानिसमा गनिन सकुँ ।

source: Research in various parts of India shows that three out of every 10 girls are not aware of menstruation at the time of their first periods.
ne: भारतका विभिन्न स्थानमा गरिएको अनुसन्धान अनुसार, १० मा ३ जना युवतीहरु पहिलोपटक रजश्वला हुँदासम्म पनि यो के हो भन्ने विषयमा अन्जान छन् ।

source: And in some parts of Rajasthan this number is as high as nine out of 10 girls being unaware of it.
ne: अझ राजस्थानका केही भागहरुमा यो संख्या अझ बिकराल छ १० मा ९ बालिकालाइ आफूलाई यो के भैरहेको छ भन्ने पनि थाहा छैन ।

source: You'd be surprised to know that most of the girls that I have spoken to, who did not know about periods at the time of their first menstruation thought that they have got blood cancer and they're going to die soon.
ne: तपाइलाई यो सुन्दा आश्चर्य लाग्ला मैले कुरा गरेका अधिकांश युवतीहरु, पहिलो पटक रजस्वला हुँदासम्म पनि यती अन्जान थिए, महिनावारीको रगत देखेर "मलाई ब्लड क्यान्सर भएछ, अब मर्छु कि क्या हो" भनेर आत्तिएका थिए ।

source: Menstrual hygiene is a very important risk factor for reproductive tract infections.
ne: प्रजन प्रणालीमा हुनसक्ने संक्रमणको प्रमुख कारण महिनावारी हुँदा गरिने सरसफाइ हो ।

source: But in India, only 12 percent of girls and women have access to hygienic ways of managing their periods.
ne: तर भारतमा, केवल १२% बालिका तथा महिलाहरुसँग मात्रै महिनावारी हुँदा आवश्यक पर्ने स्वच्छ तरिकाको पहुँच छ ।

source: If you do the math, 88 percent of girls and women use unhygienic ways to manage their periods.
ne: यदि हिसाब गरि हेर्ने हो भने, ८८% बालिका तथा महिलाहरु रजस्वला हुँदा

source: I was one of them.
ne: अस्वस्थ तरिका अपनाउन बाध्य छन् । त्यस्तैहरुमध्ये म पनि एक हुँ ।

source: I grew up in a small town called Garhwa, in Jharkhand, where even buying a sanitary napkin is considered shameful.
ne: म झारखण्डको एउटा सानो सहर गडवाहामा हुर्किएकी हुँ, जहाँ स्यानीटरी न्याप्किन किन्नु लाजमर्दो मानिन्छ ।

source: So when I started getting my periods, I began with using rags.
ne: तेसैले, महिनावारी हुन थालेदेखि म - कपडा (टालो) प्रयोग गर्न थालें ।

source: After every use I would wash and reuse them.
ne: हरेक महिनावारी पछि त्यो टालो सफा गरेर राख्थें र

source: But to store them, I would hide and keep it in a dark, damp place so that nobody finds out that I'm menstruating.
ne: अर्को पटक फेरी प्रयोग गर्थें । महिनावारी भएको कसैले थाहा नपाउन् भनेर त्यो टालो अँध्यारो कुनामा कसैले नदेख्ने गरी लुकाउथें ।

source: Due to repeated washing the rags would become coarse, and I would often get rashes and infections using them.
ne: बारम्बारको प्रयोगले त्यो कपडा खस्रो हुँदै गयो अनि पाछेर फोका उठ्ने र संक्रमण हुन थाल्यो ।

source: I wore these already for five years until I moved out of that town.
ne: झन्डै ५ बर्ष, अर्को शहर नगएसम्म तेस्तै टालो प्रयोग गरिरहें ।

source: Another issue that periods brought in my life those of the social restrictions that are imposed upon our girls and women when they're on their periods.
ne: महिनावारीले मेरो जीवनमा अर्को एउटा विषय उठायो - बालिका तथा महिलाहरुमाथि गरिने सामाजिक दुर्व्यवहार ।

source: I think you all must be aware of it, but I'll still list it for the few who don't.
ne: तपाईहरुलाई यो कुरा थाहा छ तैपनि, थाहा नहुनेहरूको लागि

source: I was not allowed to touch or eat pickles.
ne: केहि बुँदाहरु भन्न गइरहेको छु - रजस्वला भएको बेलामा मलाई अचार छुन वा खान अनुमति थिएन

source: I was not allowed to sit on the sofa or some other family member's bed.
ne: सोफामा बस्न दिइन्न थियो न त परिवारका सदस्यहरुको खाटमा बस्न नै ।

source: I had to wash my bed sheet after every period, even if it was not stained.
ne: हरेकपल्टको महिनावारिपछी ओछ्यानको खोल, तन्ना धुनै पर्दथ्यो, चाहे कुनै दाग होस् वा नहोस्।

source: I was considered impure and forbidden from worshipping or touching any object of religious importance.
ne: मलाई अपवित्र मानिन्थ्यो, मलाई कुनै पनि पूजा-आजामा भाग लिन वा पूजा सामाग्री छुन बन्देज थियो ।

source: You'll find signposts outside temples denying the entry of menstruating girls and women.
ne: मंदिर बाहिर साइनबोर्ड नै देख्नसक्नुहुन्छ महिनावारी भएकाहरु प्रवेश निषेध

source: Ironically, most of the time it is the older woman who imposes such restrictions on younger girls in a family.
ne: दुखको कुरा, धेरै जस्तो घरका बुढापाका महिलाहरु नै यस्ता नियम पालना गर्न लगाऊछन् ।

source: After all, they have grown up accepting such restrictions as norms.
ne: आफूले जस्तो भोगे, अरुलाई तेस्तै गराए ।

source: And in the absence of any intervention, it is the myth and misconception that propagate from generation to generation.
ne: नयाँ विचारको अभावमा पुराना कुसंस्कार नै संस्कार बनेर एउटा पुस्ताबाट अर्को पुस्तामा सर्दैछ ।

source: During my years of work in this field, I have even come across stories where girls have to eat and wash their dishes separately.
ne: यस क्षेत्रमा कामको अवधिमा मैले यस्ता घटनाहरु धेरै भेटेकी छु जहाँ, महिलाहरुलाई खाने देखि भाँडा सफासमेत छुट्टै बसेर गर्नुपर्छ

source: They're not allowed to take baths during periods, and in some households they are even secluded from other family members.
ne: कतिपय घरमा महिनावारी भएकाहरुले नुहाउन नपाउने, परिवारदेखि भिन्नै राखिने समेत चलन छ ।

source: About 85 percent of girls and women in India would follow one or more restrictive customs on their periods every month.
ne: भारतका ८५% बालिका तथा महिलाहरु महिनावारी हुँदा कुनै न कुनै चलनले पीड़ित भएकै हुन्छन्

source: Can you imagine what this does to the self-esteem and self-confidence of a young girl?
ne: बिचार गर्नुहोस् त, यस्तो चलनले एउटा युवतीको आत्म-सम्मान र आत्म-विश्वासमा कस्तो असर पार्छ होला ?

source: The psychological trauma that this inflicts, affecting her personality, her academic performance and every single aspect of growing up during her early formative years?
ne: बढ्दो उमेरमा यसले पार्नसक्ने मनोबैज्ञानिक असरले उनको व्यक्तित्व, शैक्षिक प्रगतिमा कति नकारात्मक असर पार्ला ?

source: I religiously followed all these restrictive customs for 13 years, until a discussion with my partner, Tuhin, changed my perception about menstruation forever.
ne: यी अन्धविश्वासी चलनहरु मैले पनि १३ वर्ष पालना गरें । र मैले साथी "तुहिन" लाई भेटे पछि, उसँगको छलफल पछि, महिनावारी प्रतिको मेरो धारणा बदलियो ।

source: In 2009, Tuhin and I were pursuing our postgraduation in design.
ne: सन् २००९ को कुरा हो, तुहिन र म - डिजाइन विषयमा स्नातक गर्दै थियौं ।

source: We fell in love with each other and I was at ease discussing periods with him.
ne: हामी एक अर्कालाई मनपराउन थाल्यौं। उ सँगको सामिप्यले मलाई उ सँग खुलेर कुरा गर्न सजिलो भयो ।

source: Tuhin knew little about periods.
ne: तुहिनलाई महिनावारीको विषयमा अलिअलि मात्रै थाहा रहेछ ।

source: (Laughter) He was astonished to know that girls get painful cramps and we bleed every month.
ne: (हाँसो) हरेक महीना रजस्वला हुँदा महिलाहरुको तल्लोपेट बेस्सरी दुख्छ र रगत पनि बग्छ भन्ने सुनेर

source: (Laughter) Yeah.
ne: उसलाई अचम्म लाग्यो । (हाँसो)

source: He was completely shocked to know about the restrictions that are imposed upon menstruating girls and women by their own families and their society.
ne: रजस्वला हुँदा महिलाहरुमाथि परिवार र समाजबाटै हुने दुर्व्यहारको बारेमा सुनेर उ स्तब्ध भयो !

source: In order to help me with my cramps, he would go on the Internet and learn more about menstruation.
ne: ! उ, रजस्वला हुँदाको मेरो दुखाइलाई कम गर्ने उपाय इन्टरनेटमा खोज्न थाल्यो ।

source: When he shared his findings with me, I realized how little I knew about menstruation myself.
ne: उसले थाहा पाएको कुरा मलाई सुनाउँदा थाहा भयो, मलाई नै रजस्वलाको बारेमा

source: And many of my beliefs actually turned out to be myths.
ne: कति कम थाहा रहेछ । कतिपय मेरा विश्वासहरु अन्धविश्वास मात्र रहेछन्।

source: That's when we wondered: if we, being so well educated, were so ill-informed about menstruation, there would be millions of girls out there who would be ill-informed, too.
ne: मेरो मनमा यस्तो विचार उठ्यो, यति पढ़े लेखेको हुँदा त महिनावारीको बारेमा गलत जानकारी रहेछ भने, संसारमा यस्ता लाखौ युवतीहरु होलान् जसलाई महिनावारीको बारेमा

source: To study -- to understand the problem better, I undertook a year-long research to study the lack of awareness about menstruation and the root cause behind it.
ne: अति कम जानकारी होला । समाजमा महिनावारीको बारेमा किन चर्चा गरिँदैन र किन यसलाई लाजको रुपमा हेरिन्छ, यो पत्ता लगाउन मैले १ बर्षे रिसर्च थालेँ

source: While it is generally believed that menstrual unawareness and misconception is a rural phenomenon, during my research, I found that it is as much an urban phenomenon as well.
ne: साधारणतया, महिनावारीको विषयमा अज्ञान तथा गलत धारणा ग्रामीण परिवेशमा मात्रै छ भन्ने लाग्छ । तर मैलेअध्ययनको क्रममा के थाहा पाएँ भने, यो समस्या शहरी क्षेत्रमा पनि उस्तै छ ।

source: And it exists with the educated urban class, also.
ne: पढेलेखेका शहरी क्षेत्रका मान्छेको धारणा पनि उस्तै छ ।

source: While talking to many parents and teachers, I found that many of them actually wanted to educate girls about periods before they have started getting their menstrual cycle.
ne: धेरै अभिभावक तथा शिक्षकहरुसँग छलफल गर्दा के थाहा भयो भने, उनीहरु पनि उमेर पुगेका युवतीहरुलाई बेलैमा रजस्वलाको बारेमा जानकारी दिन त चाहन्छन,

source: And -- but they lacked the proper means themselves.
ne: तर समाजले लाजको रुपमा हेरेको यो विषयमा

source: And since it is a taboo, they feel inhibition and shameful in talking about it.
ne: उपाय नपाएर विवश रहेछन् ।

source: Girls nowadays get their periods in classes six and seven, but our educational curriculum teaches girls about periods only in standard eight and nine.
ne: अचेलका युवतीहरुको कक्षा ६ वा ७ मा पढ्दादेखि नै महिनावारी हुन थाल्छ । तर हाम्रो पाठ्यक्रममा रजस्वलाको बारेमा कक्षा ८/९ मा मात्रै पढ़ाइन्छ ।

source: And since it is a taboo, teachers still skip the subject altogether.
ne: अप्ठ्यारो मानेर शिक्षकहरुले यो पाठ नै पढ़ाउदैनन् ।

source: So school does not teach girls about periods, parents don't talk about it.
ne: विद्यालयमा महिनावारीको विषयमा पढाइ नै हुदैन , अविभावकहरु यस विषयमा कुरै गर्दैनन,

source: Where do the girls go?
ne: अनि युवतीहरुले थाहा पाउने कहाँबाट ?

source: Two decades ago and now -- nothing has changed.
ne: २ दशक अघिको र अहिलेको अवस्थामा केही परिवर्तन छैन ।

source: I shared these finding with Tuhin and we wondered: What if we could create something that would help girls understand about menstruation on their own -- something that would help parents and teachers talk about periods comfortably to young girls?
ne: यही कुरा मैले तुहिनलाई सुनाएँ र हामीले सोच्यौं केही यस्तो काम गर्नपाए हुन्थ्यो, जसको मद्धतले केटीहरु आफैले महिनावारीको विषयमा बुझ्न सकून्, कुनै यस्तो तरीका, जसले अभिभावक एवं शिक्षकहरुलाई युवतीहरुसँग महिनावारीको विषयमा छलफल गर्न सहज बनावोस् ।

source: During my research, I was collecting a lot of stories.
ne: मेरो रिसर्चको क्रममा मैले धेरै नै घटनाहरु जम्मा गरेको छू । यी घटनाहरु

source: These were stories of experiences of girls during their periods.
ne: युवतीहरुले महिनावारी हुँदा भोगेका हुन् ।

source: These stories would make girls curious and interested in talking about menstruation in their close circle.
ne: आफैले भोगेका विषयमा आफ्नो समूहमा कुराकानी गर्न सबैलाई उत्सुकता लाग्छ ।

source: That's what we wanted.
ne: हो, हामीले चाहेको यस्तै हो ।

source: We wanted something that would make the girls curious and drive them to learn about it.
ne: हामी यिनै कथाहरुलाई लिएर युवतीहरुको मनमा उत्सुकता बढाउँदै रजस्वलाको बारेमा जानकारी दिन सक्छौं ।

source: We wanted to use these stories to teach girls about periods.
ne: हामीले यिनै कथाहरुहरुलाई जानकारीको स्रोतको रुपमा उपयोग गर्ने विचार गर्यौं ।

source: So we decided to create a comic book, where the cartoon characters would enact these stories and educate girls about menstruation in a fun and engaging way.
ne: हामीले एउटा 'कमिक' बनाउने निर्णय गर्यौ । कार्टूनका चरित्रहरुले नाटकीयरुपमा यी कथाहरुलाई प्रस्तुत गरेर युवतीहरुलाई महिनावारीको विषयमा रमाइलो ढंगले जानकारी गराउन सक्छ ।
